exemples/XML/ConsultarNfseServicoTomado/ConsultarNfseServicoTomado.xml

<ConsultarNfseServicoTomadoEnvio xmlns="http://www.abrasf.org.br/nfse.xsd">
	<Consulente>
		<CpfCnpj>
			<Cnpj></Cnpj>
		</CpfCnpj>
		<InscricaoMunicipal></InscricaoMunicipal>
	</Consulente>
	<NumeroNfse></NumeroNfse>
	<PeriodoEmissao>
		<DataInicial></DataInicial>
		<DataFinal></DataFinal>
	</PeriodoEmissao>
	<PeriodoCompetencia>
		<DataInicial></DataInicial>
		<DataFinal></DataFinal>
	</PeriodoCompetencia>
	<Prestador>
		<CpfCnpj>
			<Cnpj></Cnpj>
		</CpfCnpj>
		<InscricaoMunicipal></InscricaoMunicipal>				
	</Prestador>
	<Tomador>
		<CpfCnpj>
			<Cnpj></Cnpj>
		</CpfCnpj>
		<InscricaoMunicipal></InscricaoMunicipal>				
	</Tomador>
	<Intermediario>
		<CpfCnpj>
			<Cnpj></Cnpj>
		</CpfCnpj>
		<InscricaoMunicipal></InscricaoMunicipal>				
	</Intermediario>
	<Pagina></Pagina>
</ConsultarNfseServicoTomadoEnvio>

----------------------------------------
<!--Com o cabeçalho Soap-->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:e="http://www.abrasf.org.br/nfse.xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <e:ConsultarNfseServicoTomado>
        <nfseCabecMsg>
					<![CDATA[
						 <cabecalho xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.02"><versaoDados>2.02</versaoDados></cabecalho>
					]]>
				</nfseCabecMsg>
        <nfseDadosMsg>
					<![CDATA[
						<ConsultarNfseServicoTomadoEnvio xmlns="http://www.abrasf.org.br/nfse.xsd">
							<Consulente>
								<CpfCnpj>
									<Cnpj></Cnpj>
								</CpfCnpj>
								<InscricaoMunicipal></InscricaoMunicipal>
							</Consulente>
							<NumeroNfse></NumeroNfse>
							<PeriodoEmissao>
								<DataInicial></DataInicial>
								<DataFinal></DataFinal>
							</PeriodoEmissao>
							<PeriodoCompetencia>
								<DataInicial></DataInicial>
								<DataFinal></DataFinal>
							</PeriodoCompetencia>
							<Prestador>
								<CpfCnpj>
									<Cnpj></Cnpj>
								</CpfCnpj>
								<InscricaoMunicipal></InscricaoMunicipal>				
							</Prestador>
							<Tomador>
								<CpfCnpj>
									<Cnpj></Cnpj>
								</CpfCnpj>
								<InscricaoMunicipal></InscricaoMunicipal>				
							</Tomador>
							<Intermediario>
								<CpfCnpj>
									<Cnpj></Cnpj>
								</CpfCnpj>
								<InscricaoMunicipal></InscricaoMunicipal>				
							</Intermediario>
							<Pagina></Pagina>
						</ConsultarNfseServicoTomadoEnvio>
					]]>
				</nfseDadosMsg>
      </e:ConsultarNfseServicoTomado>
   </soapenv:Body>
</soapenv:Envelope>