exemples/XML/ConsultarNfsePorRps/ConsultarNfsePorRpsPopulado.xml

<ConsultarNfseRpsEnvio xmlns="http://www.abrasf.org.br/nfse.xsd">
	<IdentificacaoRps>
		<Numero>24</Numero>
		<Serie>A1</Serie>
		<Tipo>1</Tipo>
	</IdentificacaoRps>
	<Prestador>
		<CpfCnpj>
			<Cnpj>45111111111100</Cnpj>
		</CpfCnpj>
		<InscricaoMunicipal>123498</InscricaoMunicipal>
	</Prestador>
</ConsultarNfseRpsEnvio>

------------------------------
<!-- Com o cabeçalho Soap -->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:e="http://www.abrasf.org.br/nfse.xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <e:ConsultarNfsePorRps>
				<nfseCabecMsg>
					<![CDATA[
						 <cabecalho xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.02"><versaoDados>2.02</versaoDados></cabecalho>
					]]>				
				</nfseCabecMsg>
        <nfseDadosMsg>
					<![CDATA[
						<ConsultarNfseRpsEnvio xmlns="http://www.abrasf.org.br/nfse.xsd">
							<IdentificacaoRps>
								<Numero>24</Numero>
								<Serie>A1</Serie>
								<Tipo>1</Tipo>
							</IdentificacaoRps>
							<Prestador>
								<CpfCnpj>
									<Cnpj>45111111111100</Cnpj>
								</CpfCnpj>
								<InscricaoMunicipal>123498</InscricaoMunicipal>
							</Prestador>
						</ConsultarNfseRpsEnvio>
					]]>
				</nfseDadosMsg>
      </e:ConsultarNfsePorRps>
   </soapenv:Body>
</soapenv:Envelope>